while True:
    money = int(input('请输入利润:'))
    if money <= 100000:
        print('奖金是: %d'% (money*0.1))
    elif money <= 200000:
        print('奖金是: %d' % ((money-100000) * 0.075 + 100000*0.1))
    elif money <= 400000:
        print('奖金是: %d' % ((money - 200000) * 0.05 + 100000 * 0.075 + 100000 * 0.1))
    elif money <= 600000:
        print('奖金是: %d' % ((money - 400000) * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1))
    elif money <= 1000000:
        print('奖金是: %d' % ((money - 600000) * 0.015 + 200000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1))
    elif money > 1000000:
        print('奖金是: %d' % ((money - 1000000) * 0.01 + 400000 * 0.015 + 200000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1))

